package ru.surrsoft.baaz.suite.new_.misc;

import ru.surrsoft.baaz.univers.Unox;

/**
 * ^[[etof]] - это множество у которого:
 * 1) все элементы это только {@link Unox}
 * 2) соблюдается правило ^[oeta]
 * <p>
 * ПОНЯТИЯ:
 * ^[[oeta]] - правило - _элемент А множества Б может иметь в качестве _родителя только одно из:
 * 1) NULL
 * 2) _элемент множества Б не являющийся _потомком А
 * 3) _элемент отсутствующий во множестве Б
 * <p>
 * СМ ТАКЖЕ:
 * <li> Vcnv.java - утилитные методы для работы с [etof]-множествами </li>
 * <p>
 * #id [[w391w]] [n2391]
 * <p>
 * ВЕРСИЯ 2 1.1 2019-02-05 (stored)
 */
public class _Etof {
  private _Etof() {
  }
}
